<?php

namespace App\Helpers;

class RestUtils
{

    public static function getStdObj()
    {
        return new \stdClass();
    }

    /**
     * 获取错误代码的错误信息
     *
     * @param $code
     *
     * @return mixed|string
     */
    public static function getErrorMessage($code)
    {
        $codeMsg = [
            '1' => '出错啦,请重试',
            '1000' => 'url请求参数不正确',
            '1001' => '错误的token值',
            '1002' => '参数错误或未产生返回值',
            '1003' => '不存在的类名',
            '1004' => '数据添加错误',
            '1005' => '暂无数据',
            '1006' => '方法调用错误',
            '1007' => 'data 格式错误',
            '1500' => '暂无数据',
            '2000' => '出错啦,请重试',
            '2101' => '创建失败',
            '2102' => '更新失败',
            '2103' => '提交数据出错',
            '2105' => '出错啦,请刷新重试',

            //用户管理
            '1101' => '用户名或密码错误',
            '1102' => '用户名或密码错误',
            '1103' => 'accessToken错误',
            '1104' => '用户已注册',
            '1105' => '用户注册成功',
            '1106' => '用户名不存在',
            '1108' => '密码修改成功',
            '1109' => '密码修改失败',
            '1110' => '等待退出',
            '1111' => '错误',
            '1112' => '请输入正确的手机号',
            '1113' => '请选择身份',
            '1114' => '绑定手机号失败',
            '1115' => '手机号已注册',
            '1116' => '用户错误',
            '1117' => '不能为空',
            '1118' => '不可重复提交',
            '1119' => '密码不能为空',
            '1120' => '抱歉，用户名已被占用...',
            '1121' => '修改手机号成功',
            '1122' => '修改手机号失败',
            '1123' => '1-20个字符，支持中英文、数字和特殊符号',
            '1124' => '手机号未注册',
            '1125' => '暂不支持修改手机号,敬请谅解!',

            //用户身份
            '1126' => '获取身份证照片错误',
            '1127' => '请使用真实身份证',
            '11128' => '抱歉，该用户未验证过身份信息',
            '11129' => '抱歉，用户信息匹配失败',
            '12000' => '验证未通过，请身份证持有者进行认证',
            '12001' => '不可以使用软件合成人脸',
            '12002' => '不可以使用屏幕翻拍人脸',
            '12003' => '不可以使用面具',
            '12004' => '身份证号码模糊，请重新扫描',
            '12005' => '身份证性别识别错误',
            '12006' => '有效期限识别错误',
            '12007' => '不支持临时身份证！',
            '12008' => '此证件已绑定其他账号，请更换身份证！',
            '12009' => '请先完成身份证正面扫描',
            '12010' => '请使用同一身份证号认证！',

            //订单
            '1130' => '渠道不存在',
            '1136' => '订单创建失败',
            '1138' => '订单入数据库失败',
            '1139' => '订单类型不存在',
            '1140' => '暂停服务',
            '1141' => '申请订单失败',
            '1142' => '信息不存在',

            //用户信用报告
            '13000' => '请您先进行认证才能付费费查询报告呦！',
            '13001' => '芝麻信用正在处理中！',
            '13002' => '运营商正在处理中！',
            '13003' => '报告生成中……！',
            '13004' => '支付处理中……！',
            '13005' => '未生成报告订单',
            '13006' => '报告数据正在采集中……',

            //验证码相关
            '1200' => '短信验证码发送成功',
            '1201' => '在1分钟内不能重复获取验证码',
            '1202' => '请输入手机号码',
            '1203' => '短信验证码失效',
            '1204' => '短信验证码错误,请重新输入',
            '1205' => '短信验证码发送失败',
            '1206' => '短信验证码请求达到上限',

            //服务器
            '500' => '服务器',

            //错误提示
            '20000' => '没有更新的账单数据哦！',
            '20001' => '暂无账单！',
            '20002' => '对不起, 您访问的链接不存在',

        ];

        return isset($codeMsg[$code]) ? $codeMsg[$code] : '';
    }
}
